{
  "experience": [
    {
      "business": "Epic Systems",
      "job-title": "Software Developer",
      "responsibilities": [
        {
          "title": "Full-stack engineering",
          "description": " Engineered solutions for customer-requested workflows using technologies across multiple platforms and frameworks. Conducted code review for new features and bug fixes. Pioneered best practices for coding standards and documentation"
        },
        {
          "title": "Project management",
          "description": "Based on customer feedback, led the integration of new functionalities into the design and development process of an integrated app activity. Facilitated delegation of tasks in order to meet deadlines and quality standards."
        },
        {
          "title": "Mentoring",
          "description": "Mentored a fellow software developer at Epic. Conducted weekly check-ins, assisting with project management and development. Played an active role in personal and professional growth, aiding in mentee’s transition from college into the professional sphere"
        }
      ]
    }
  ],
  "education": [
    {
      "university": "University of Texas at Austin",
      "degree": "Bachelor of Sciences - Computer Science",
      "courses": [
        "Algorithms and Complexity",
        "Data Structures",
        "Computer Organization and Architecture",
        "Operating Systems",
        "Computer Networks",
        "Modern Web Applications",
        "Data Mining",
        "Computer Graphics",
        "Compilers"
      ]
    }
  ],
  "skills": [
    {
      "category": "Languages",
      "items": [
        "Swift",
        "Kotlin",
        "Java",
        "Python",
        "C++",
        "Typescript"
      ]
    },
    {
      "category": "Toolkits",
      "items": [
        "SwiftUI",
        "Docker",
        "git",
        "pandas",
        "NumPy",
        "scikit-learn"
      ]
    },
    {
      "category": "Platforms",
      "items": [
        "Linux",
        "Web",
        "Windows",
        "iOS",
        "Android",
        "AWS",
        "Azure"
      ]
    }
  ],
  "projects": [
    {
      "title": "Integrated checklist (iOS)",
      "description": "Engineered a solution to enhance functionality of Epic iOS application based on existing features of legacy systems. Leveraged novel frameworks for the improvement of user experience in terms of supplementation of the software suite.",
      "tech": "Swift (SwiftUI), M, Objective-C",
      "timeframe": "2022"
    },
    {
      "title": "Connectivity tracking (Android)",
      "description": "nhanced user understanding of device connectivity and available features pertaining to device state. Leveraged cellphone connectivity data to improve the presentation of connectivity status to users. Established a framework to broaden availability of data for users and for expanded functionality.",
      "tech": "Kotlin, Java, M",
      "timeframe": "2022"
    },
    {
      "title": "Personal website (Web & Delployment)",
      "description": "Created React application for experimenting with personal projects. Deployed production build to SSL-enabled Apache web server. Launched Amazon EC2 instance to ensure stable endpoint for domain.",
      "tech": "ReactJS, Apache HTTP Server, Amazon EC2",
      "timeframe": "2020-2022"
    },
    {
      "title": "Analysis of parallel 3D printer (Optimization)",
      "description": "Optimized a parameter (base size, arm length, and motor axle diameter) of a 3D printer. Generalized optimization to any parallel robot based on the other two parameters and input kinematic equation.",
      "tech": "Python, NumPy, OpenCV",
      "timeframe": "2017"
    }
  ],
  "publications": [
    {
      "type": "Article",
      "title": "Critique of \"MemXCT: Memory-Centric X-Ray CT Reconstruction With Massive Parallelization\" (High-Performance Computing, Reproducibility)",
      "description": "Continuation of reproducibility portion of the 2020 Student Cluster Competition during the SC20 high-performance computing conference. Received source code from research paper, designed and deployed Azure cluster to reproduce, analyze, and critique the results seen in the paper.",
      "tech": "Azure, CUDA",
      "timeframe": "2020-2021"
    }
  ]
}